#+title: Visualización de series de tiempo {{{newline}}} en Python
#+author: {{{erika}}}{{{newline}}} {{{margarita}}}{{{newline}}} {{{rafael}}}{{{newline}}}
#+date: @@latex:\protect\tiny@@ 6 de julio de 2017

#+macro: newline @@latex:\\[0.6em]@@ @@html:<br>@@
#+macro: aamf Área Académica de Matemáticas y Física
#+macro: rafael Rafael Villarroel Flores
#+macro: rvf {{{rafael}}}\footnote{ {{{rafael}}}. Profesor Investigador del {{{aamf}}}. Autor de correspondencia. Correo electrónico: rafaelv@uaeh.edu.mx}
#+macro: erika Erika Elizabeth Rodríguez Torres
#+macro: eert {{{erika}}}\footnote{ {{{erika}}}. Profesora Investigadora del {{{aamf}}}. Correo electrónico: erikart@uaeh.edu.mx}
#+macro: margarita Margarita Tetlalmatzi Montiel
#+macro: mtm {{{margarita}}}\footnote{ {{{margarita}}}. Profesora Investigadora del {{{aamf}}}. Correo electrónico: tmontiel@uaeh.edu.mx}

#+property: header-args :tangle yes :cache yes

#+language: es

#+options: ':t toc:nil H:2

#+latex_class: beamer-talk
#+startup: beamer
#+beamer_theme: metropolis [numbering=none, block=fill]

#+latex_header: \usepackage{xcolor}
#+latex_header: \usepackage{url}

#+latex_header: \usepackage{listings}
#+latex_header: \lstset{
#+latex_header:   literate={í}{{\'\i}}1
#+latex_header:            {á}{{\'a}}1
#+latex_header:            {é}{{\'e}}1
#+latex_header:            {ó}{{\'o}}1
#+latex_header:            {ú}{{\'u}}1
#+latex_header: }
#+latex_header: \lstalias{ipython}{python}

#+beamer_header: \languagepath{spanish}
#+beamer_header: \beamerdefaultoverlayspecification{<+->}

** Propiedades de gráficas

   #+beamer: \vspace*{5mm}

   Una vez que la gráfica ha sido creada en Python, es posible obtener
   propiedades de la gráfica. Por ejemplo:

   #+BEGIN_SRC ipython :session :exports code
P.nodes()   
   #+END_SRC

   #+RESULTS[a8b41ccc37ae078b2ac6b59a61da4c18b47de20a]:
   | a | c | b |

   #+name: vertices
   #+BEGIN_SRC ipython :session :exports results :results output
print P.nodes()
   #+END_SRC

   produce:

   #+RESULTS[7851ad5f58f2eed03ecfc485c83d5ceae95bd918]: vertices
   : ['a', 'c', 'b']

   #+beamer: \pause
   mientras que:

   #+name: grado
   #+BEGIN_SRC ipython :session :exports both
P.degree('b')
   #+END_SRC

   produce:

   #+RESULTS[03d72212476a7c481217c58e24ae4074eda8177e]: grado
   : 2

* Hidden code                                                      :noexport:

  #+name: inicio-mp
  #+BEGIN_SRC emacs-lisp :var diam="0.4" :results latex
(concat "\\begin{center}\n"
  "\\begin{minipage}{"
  diam
  "\\linewidth}\n"
  )
  #+END_SRC

  #+name: enmedio-mp
  #+begin_src emacs-lisp :var ndiam="0.4" :results latex
(concat "\\end{minipage}\n"
   "\\begin{minipage}{"
   ndiam
   "\\linewidth}")
  #+end_src

  #+name: final-mp
  #+begin_src emacs-lisp :var capt="Mi figura" labl="fig:1" :results latex
(concat "\\end{minipage}\n"
   "\\caption{"
   capt
   "}\n"
   "\\label{"
   labl
   "}\n"
   "\\end{center}\n"
   )
  #+end_src

#+BEGIN_SRC emacs-lisp
(org-ref-find-bibliography)
#+END_SRC

#+RESULTS:
: series.bib

#+BEGIN_SRC emacs-lisp
(ox-ipynb-export-to-ipynb-file)
#+END_SRC

